app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
<<<<<<< HEAD
<<<<<<< HEAD
    @courses = Course.search(params[:search])

INSERT INTO "courses" ("Course_num", "Title", "Description", "Instructor", "Status", "Start_date", "End_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)
    respond_to do |format|
      if @course.save